---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructConnectionApplyTo
source: html/da6f358c-88e8-5b33-f90d-cf2699a9260f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructConnectionApplyTo Property

"Apply to"

## Syntax (C#)
```csharp
public static ForgeTypeId StructConnectionApplyTo { get; }
```